# Introduction to Pandas DataFrame

- Data frame is a main object in pandas. It is used to represent data with rows and columns.
- Data frame is a data structure represent the data in tabular or excel spread sheet like data.

### Creating DataFrame:

In [1]:
import pandas as pd
df = pd.read_csv("weather_data.csv")  #read weather.csv
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [2]:
#List of Tuples

weather_data = [('1/1/2017', 32, 6, "Rain"),
               ('1/2/2017', 35, 7, "Sunny"),
               ('1/3/2017', 28, 2, 'Snow'),
               ('1/4/2017', 24, 7, "Snow"),
               ('1/5/2017', 32, 4, "Rain"),
               ('1/6/2017', 32, 2, "Sunny")]

df = pd.DataFrame(weather_data,columns = ["Date","Temperature", "WindSpeed", "Event"])
df

       Date  Temperature  WindSpeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

In [3]:
#get dimensions of the table
df.shape

(6, 4)

In [4]:
#If you want to see some initial rows then we use head() command (5 rows)
df.head()

       Date  Temperature  WindSpeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [5]:
#if you want to see last few rows then we use tail() command (5 rows)
df.tail()

       Date  Temperature  WindSpeed  Event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           32          2  Sunny

In [9]:
#SLicing
df[2:5]

       Date  Temperature  WindSpeed Event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [10]:
df.columns #print columns in a table

Index(['Date', 'Temperature', 'WindSpeed', 'Event'], dtype='object')

In [13]:
#print particular column data
df.Date

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: Date, dtype: object

In [15]:
#Another way of accessing column
df['Date']   #or df.Date ( both are same)

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: Date, dtype: object

In [16]:
#get two or more columns

df[['Date','Event']]

       Date  Event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [17]:
#get all temperature
df['Temperature']

0    32
1    35
2    28
3    24
4    32
5    32
Name: Temperature, dtype: int64

In [18]:
#print max temperature

df['Temperature'].max()

35

In [19]:
#print min temperature
df['Temperature'].min()

24

In [21]:
#print max temperature

df['Temperature'].describe()

count     6.000000
mean     30.500000
std       3.885872
min      24.000000
25%      29.000000
50%      32.000000
75%      32.000000
max      35.000000
Name: Temperature, dtype: float64

In [22]:
#select row which has maximum temperature
df[df.Temperature == df.Temperature.max()]

       Date  Temperature  WindSpeed  Event
1  1/2/2017           35          7  Sunny

In [24]:
#Select only day column which has the maximum temperature

df.Date[df.Temperature == df.Temperature.max()]

1    1/2/2017
Name: Date, dtype: object